# TitleStyleUnderline Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..TitleStyleUnderline Property
ParameterTypeId Class See Also
---
"Underline"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId TitleStyleUnderline { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TitleStyleUnderline As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TitleStyleUnderline {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace